soburi/JN516x-arduino-package/boards.txt

twelite.name=TOCOS TWE-Lite

twelite.upload.tool=jn51xxprogrammer
twelite.upload.protocol=jn51xx

twelite.build.jennic_mcu_family=JN516x
twelite.build.jennic_mcu_model_no=5164
twelite.build.mcu=JN{build.jennic_mcu_model_no}
twelite.build.board=TWE_LITE
# use clock frequency.
twelite.build.f_cpu=16000000L
twelite.build.usb_product="TWE-Lite-R"
twelite.build.core=arduino
twelite.build.ldscript=
twelite.build.variant=twelite
twelite.build.variant_system_include=
